###Introduction to Pandas

In [3]:
print("introduction to PANDAS")

introduction to PANDAS

### Key Data Structure in Pandas
* Series (1 Dimensional)
* DataFrame (Famous)(2 Dimensional)

In [5]:
!conda install pandas

Jupyter detected...

CondaToSNonInteractiveError: Terms of Service have not been accepted for the following channels. Please accept or remove them before proceeding:
    - https://repo.anaconda.com/pkgs/main
    - https://repo.anaconda.com/pkgs/r
    - https://repo.anaconda.com/pkgs/msys2

To accept these channels' Terms of Service, run the following commands:
    conda tos accept --override-channels --channel https://repo.anaconda.com/pkgs/main
    conda tos accept --override-channels --channel https://repo.anaconda.com/pkgs/r
    conda tos accept --override-channels --channel https://repo.anaconda.com/pkgs/msys2

For information on safely removing channels from your conda configuration,
please see the official documentation:

    https://www.anaconda.com/docs/tools/working-with-conda/channels

In [2]:
import pandas as pd

In [7]:
s = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])

In [8]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
df = pd.DataFrame({"names": ["Shayan", "Ali", "Tayyab"], "marks": [100, 40, 70]})  #,index = ["a", "b", "c"])

In [10]:
df

    names  marks
0  Shayan    100
1     Ali     40
2  Tayyab     70

In [66]:
df = pd.read_csv("data/iris.csv")

In [67]:
df

      ID  sepal.length  sepal.width  petal.length  petal.width    variety
0      0           5.1          3.5           1.4          0.2     Setosa
1      1           4.9          3.0           1.4          0.2     Setosa
2      2           4.7          3.2           1.3          0.2     Setosa
3      3           4.6          3.1           1.5          0.2     Setosa
4      4           5.0          3.6           1.4          0.2     Setosa
..   ...           ...          ...           ...          ...        ...
145  145           6.7          3.0           5.2          2.3  Virginica
146  146           6.3          2.5           5.0          1.9  Virginica
147  147           6.5          3.0           5.2          2.0  Virginica
148  148           6.2          3.4           5.4          2.3  Virginica
149  149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 6 columns]

In [16]:
df.head()

   ID  sepal.length  sepal.width  petal.length  petal.width variety
0   0           5.1          3.5           1.4          0.2  Setosa
1   1           4.9          3.0           1.4          0.2  Setosa
2   2           4.7          3.2           1.3          0.2  Setosa
3   3           4.6          3.1           1.5          0.2  Setosa
4   4           5.0          3.6           1.4          0.2  Setosa

In [17]:
df.tail()

      ID  sepal.length  sepal.width  petal.length  petal.width    variety
145  145           6.7          3.0           5.2          2.3  Virginica
146  146           6.3          2.5           5.0          1.9  Virginica
147  147           6.5          3.0           5.2          2.0  Virginica
148  148           6.2          3.4           5.4          2.3  Virginica
149  149           5.9          3.0           5.1          1.8  Virginica

In [18]:
df.describe()

               ID  sepal.length  sepal.width  petal.length  petal.width
count  150.000000    150.000000   150.000000    150.000000   150.000000
mean    74.500000      5.843333     3.057333      3.758000     1.199333
std     43.445368      0.828066     0.435866      1.765298     0.762238
min      0.000000      4.300000     2.000000      1.000000     0.100000
25%     37.250000      5.100000     2.800000      1.600000     0.300000
50%     74.500000      5.800000     3.000000      4.350000     1.300000
75%    111.750000      6.400000     3.300000      5.100000     1.800000
max    149.000000      7.900000     4.400000      6.900000     2.500000

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            150 non-null    int64
 1   sepal.length  150 non-null    float64
 2   sepal.width   150 non-null    float64
 3   petal.length  150 non-null    float64
 4   petal.width   150 non-null    float64
 5   variety       150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

# Data Selection

In [20]:
df["ID"]

0        0
1        1
2        2
3        3
4        4
      ...
145    145
146    146
147    147
148    148
149    149
Name: ID, Length: 150, dtype: int64

In [21]:
type(df["ID"])

pandas.core.series.Series

In [23]:
df[["ID", "sepal.length"]]

      ID  sepal.length
0      0           5.1
1      1           4.9
2      2           4.7
3      3           4.6
4      4           5.0
..   ...           ...
145  145           6.7
146  146           6.3
147  147           6.5
148  148           6.2
149  149           5.9

[150 rows x 2 columns]

In [24]:
df.iloc[0]

ID                   0
sepal.length       5.1
sepal.width        3.5
petal.length       1.4
petal.width        0.2
variety         Setosa
Name: 0, dtype: object

In [27]:
df2 = pd.read_csv("data/iris2.csv")

In [29]:
df2.head(10)

   ID  sepal.length  sepal.width  petal.length  petal.width variety
0   0           5.1          3.5           1.4          0.2  Setosa
1   1           4.9          3.0           1.4          NaN  Setosa
2   2           4.7          3.2           1.3          0.2     NaN
3   3           NaN          3.1           NaN          0.2  Setosa
4   4           5.0          3.6           1.4          0.2  Setosa
5   5           5.4          3.9           1.7          NaN  Setosa
6   6           4.6          3.4           1.4          0.3  Setosa
7   7           5.0          3.4           1.5          0.2  Setosa
8   8           4.4          2.9           1.4          0.2  Setosa
9   9           4.9          3.1           1.5          0.1  Setosa

In [41]:
df3 = df2.dropna()        #dele rows with missing data(NaN)
df3.head(10)

    ID  sepal.length  sepal.width  petal.length  petal.width variety
0    0           5.1          3.5           1.4          0.2  Setosa
4    4           5.0          3.6           1.4          0.2  Setosa
6    6           4.6          3.4           1.4          0.3  Setosa
7    7           5.0          3.4           1.5          0.2  Setosa
8    8           4.4          2.9           1.4          0.2  Setosa
9    9           4.9          3.1           1.5          0.1  Setosa
10  10           5.4          3.7           1.5          0.2  Setosa
11  11           4.8          3.4           1.6          0.2  Setosa
13  13           4.3          3.0           1.1          0.1  Setosa
15  15           5.7          4.4           1.5          0.4  Setosa

In [42]:
df3 = df2.fillna(0)     # fill empty places with 0 or any other values ##warning "inplace = true" change the original data.
df3.head(10)

   ID  sepal.length  sepal.width  petal.length  petal.width variety
0   0           5.1          3.5           1.4          0.2  Setosa
1   1           4.9          3.0           1.4          0.0  Setosa
2   2           4.7          3.2           1.3          0.2       0
3   3           0.0          3.1           0.0          0.2  Setosa
4   4           5.0          3.6           1.4          0.2  Setosa
5   5           5.4          3.9           1.7          0.0  Setosa
6   6           4.6          3.4           1.4          0.3  Setosa
7   7           5.0          3.4           1.5          0.2  Setosa
8   8           4.4          2.9           1.4          0.2  Setosa
9   9           4.9          3.1           1.5          0.1  Setosa

In [37]:
df3.head()

   ID  sepal.length  sepal.width  petal.length  petal.width variety
0   0           5.1          3.5           1.4          0.2  Setosa
4   4           5.0          3.6           1.4          0.2  Setosa
6   6           4.6          3.4           1.4          0.3  Setosa
7   7           5.0          3.4           1.5          0.2  Setosa
8   8           4.4          2.9           1.4          0.2  Setosa

### Now back to iris og df.

In [45]:
df.rename(columns={"sepal.length": "SL.l", "sepal.width": "SL.w","petal.length": "PL.l", "petal.width": "PL.w"}).head(10)  ##inplace = True change the og csv file data.

   ID  SL.l  SL.w  PL.l  PL.w variety
0   0   5.1   3.5   1.4   0.2  Setosa
1   1   4.9   3.0   1.4   0.2  Setosa
2   2   4.7   3.2   1.3   0.2  Setosa
3   3   4.6   3.1   1.5   0.2  Setosa
4   4   5.0   3.6   1.4   0.2  Setosa
5   5   5.4   3.9   1.7   0.4  Setosa
6   6   4.6   3.4   1.4   0.3  Setosa
7   7   5.0   3.4   1.5   0.2  Setosa
8   8   4.4   2.9   1.4   0.2  Setosa
9   9   4.9   3.1   1.5   0.1  Setosa

In [72]:
df["sepal.length"].astype(int).head(10)

0    5
1    4
2    4
3    4
4    5
5    5
6    4
7    5
8    4
9    4
Name: sepal.length, dtype: int64

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            150 non-null    int64
 1   sepal.length  150 non-null    int64
 2   sepal.width   150 non-null    float64
 3   petal.length  150 non-null    float64
 4   petal.width   150 non-null    float64
 5   variety       150 non-null    object
dtypes: float64(3), int64(2), object(1)
memory usage: 7.2+ KB

In [71]:
df["sepal.length"][0]

np.int64(5)

In [73]:
len(df)

150

In [76]:
df["zeroes"] = [0 for i in range(len(df))]
df.head(10)

   ID  sepal.length  sepal.width  petal.length  petal.width variety  zeroes
0   0             5          3.5           1.4          0.2  Setosa       0
1   1             4          3.0           1.4          0.2  Setosa       0
2   2             4          3.2           1.3          0.2  Setosa       0
3   3             4          3.1           1.5          0.2  Setosa       0
4   4             5          3.6           1.4          0.2  Setosa       0
5   5             5          3.9           1.7          0.4  Setosa       0
6   6             4          3.4           1.4          0.3  Setosa       0
7   7             5          3.4           1.5          0.2  Setosa       0
8   8             4          2.9           1.4          0.2  Setosa       0
9   9             4          3.1           1.5          0.1  Setosa       0

In [77]:
def sq(a):
    return a * a
df["Sq_PL.l"] = df["petal.length"].apply(sq)

In [78]:
df

,ID,sepal.length,sepal.width,petal.length,petal.width,variety,zeroes,Sq_PL.l
0,0,5,3.5,1.4,0.2,Setosa,0,1.96
1,1,4,3.0,1.4,0.2,Setosa,0,1.96
2,2,4,3.2,1.3,0.2,Setosa,0,1.69
3,3,4,3.1,1.5,0.2,Setosa,0,2.25
4,4,5,3.6,1.4,0.2,Setosa,0,1.96
...,...,...,...,...,...,...,...,...
145,145,6,3.0,5.2,2.3,Virginica,0,27.04
146,146,6,2.5,5.0,1.9,Virginica,0,25.00
147,147,6,3.0,5.2,2.0,Virginica,0,27.04
148,148,6,3.4,5.4,2.3,Virginica,0,29.16
149,149,5,3.0,5.1,1.8,Virginica,0,26.01

In [81]:
df3 = df.rename(columns={"sepal.length": "SL.l", "sepal.width": "SL.w","petal.length": "PL.l", "petal.width": "PL.w"})

In [82]:
df3.to_csv("data/export.csv")

In [83]:
df4 = pd.DataFrame({
    "name" : ["Shayan", "Ali", "Tayyab"],
    "marks": [100, 40, 70]
})

In [85]:
df5 = pd.DataFrame({
    "name" : ["Ahmed", "Khursheed", "Imran"],
    "marks": [84, 56, 92]
})

In [86]:
pd.concat([df4,df5])

        name  marks
0     Shayan    100
1        Ali     40
2     Tayyab     70
0      Ahmed     84
1  Khursheed     56
2      Imran     92

In [8]:
df4 = pd.DataFrame({
    "name" : ["Shayan", "Ali", "Tayyab"],
    "marks": [100, 40, 70]
})

In [9]:
df5 = pd.DataFrame({
    "name" : ["Shayan", "Ali", "Tayyab"],
    "rollno": [68611, 65436, 70452]
})

In [10]:
pd.merge(df4, df5 , on = "name" )

     name  marks  rollno
0  Shayan    100   68611
1     Ali     40   65436
2  Tayyab     70   70452